---
kind: type
id: T:Autodesk.Revit.DB.Architecture.RailTransitionOption
source: html/da924c47-adf1-a267-c59e-abb697abd7db.htm
---
# Autodesk.Revit.DB.Architecture.RailTransitionOption

The transition type of the continuous rail.

## Syntax (C#)
```csharp
public enum RailTransitionOption
```